[
    {
        "id": 1,
        "title": "Plug pulled on rural broadband plans",
        "content": "Two out of five alternative broadband schemes have been knocked back in favour of BT, the BBC has learned."
    },
    {
        "id": 2,
        "title": "Virgin Media cost and speed increase",
        "content": "Virgin Media is increasing the cost of its broadband service but will offer a faster 152Mbps service from 2014."
    },
    {
        "id": 3,
        "title": "US file-sharing traffic in decline",
        "content": "BitTorrent traffic in the US has dipped, according to a new study, indicating that piracy might be on the decline."
    },
    {
        "id": 4,
        "title": "Apple and Samsung back in court",
        "content": "Apple and Samsung are heading back to court in a row over damages awarded in a patent action."
    },
    {
        "id": 5,
        "title": "Microwave signals turned into power",
        "content": "Researchers capture microwave signals and turn them in to electrical current capable of charging a mobile phone."
    },
    {
        "id": 6,
        "title": "Smartphone camera reveals PIN",
        "content": "Cambridge University researchers warn that your PIN can be revealed by watching your face through your smartphone camera and listening for clicks through the microphone."
    },
    {
        "id": 7,
        "title": "Warcraft world gets fifth expansion",
        "content": "The fifth expansion for World of Warcraft will see players delve into the history of the long-running online game."
    },
    {
        "id": 8,
        "title": "Vodafone profits in 'tough' trading",
        "content": "Vodafone reports a half-year pre-tax profit of £1.5bn ($2.4bn) as it says trading in Europe remained \"very tough at present\"."
    },
    {
        "id": 9,
        "title": "Security risk to 70,000 card holders",
        "content": "Up to 70,000 people in Ireland who took advantage of a customer loyalty offer could have been victims of a \"sophisticated criminal attack\"."
    },
    {
        "id": 10,
        "title": "iPhone maker Pegatron disappoints",
        "content": "Taiwan's Pegatron Corporation reports lower-than-expected third quarter profits amid reports of slowing orders for iPhone 5C."
    }
]